from django.core.management.base import BaseCommand
from DjangoHUDApp.models import Recipient
import re

class Command(BaseCommand):
    help = 'Imports a list of recipients into the database'

    def handle(self, *args, **options):
        data = [
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "ΑΣΔΕΝ", "ΑΠΟΔΕΚΤΕΣ": "482 ΤΔΒ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": ""},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "1 ΣΤΡΑΤΙΑ", "ΑΠΟΔΕΚΤΕΣ": "485 ΤΔΒ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": ""},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "ΑΣΔΥΣ", "ΑΠΟΔΕΚΤΕΣ": "466 ΤΔΒ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": ""},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "Ι ΜΠ", "ΑΠΟΔΕΚΤΕΣ": "1 ΛΔΒ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": ""},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "98 ΑΔΤΕ", "ΑΠΟΔΕΚΤΕΣ": "475 ΤΔΒΕΘ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "79 ΑΔΤΕ", "ΑΠΟΔΕΚΤΕΣ": "79 ΛΔΒΕΘ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "80 ΑΔΤΕ", "ΑΠΟΔΕΚΤΕΣ": "80 ΛΔΒΕΘ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "88 ΣΔΙ", "ΑΠΟΔΕΚΤΕΣ": "88 ΛΔΒΕΘ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "95 ΑΔΤΕ", "ΑΠΟΔΕΚΤΕΣ": "474 ΤΔΒΕΘ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "96 ΑΔΤΕ", "ΑΠΟΔΕΚΤΕΣ": "96 ΛΔΒΕΘ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "5 Α/Μ ΤΑΞ", "ΑΠΟΔΕΚΤΕΣ": "5 ΛΔΒ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "ΤΔ 41 ΣΠ", "ΑΠΟΔΕΚΤΕΣ": "ΔΡΙΑ ΔΒ/ΤΔ/41 ΣΠ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "Γ' ΣΣ", "ΑΠΟΔΕΚΤΕΣ": "489 ΤΔΒ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "Δ' ΣΣ", "ΑΠΟΔΕΚΤΕΣ": "479 ΤΔΒ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "1 ΤΑΞ ΑΣ", "ΑΠΟΔΕΚΤΕΣ": "17 ΛΔΒ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "ΔΔΕΕ", "ΑΠΟΔΕΚΤΕΣ": "13 ΜΥΕΕ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "1 ΤΑΞ ΚΔ-ΑΛ", "ΑΠΟΔΕΚΤΕΣ": "1 ΛΔΒ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "32 ΤΑΞ ΠΝ", "ΑΠΟΔΕΚΤΕΣ": "32 ΛΔΒ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "71 Α/Μ ΤΑΞ", "ΑΠΟΔΕΚΤΕΣ": "71 ΛΔΒ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "8 Μ/Π ΤΑΞ", "ΑΠΟΔΕΚΤΕΣ": "8 ΛΔΒ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "15 ΣΠ", "ΑΠΟΔΕΚΤΕΣ": "IV/9 ΛΔΒ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "10 ΣΠ", "ΑΠΟΔΕΚΤΕΣ": "3/2/489 ΤΔΒ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "9 Μ/Π ΤΑΞ", "ΑΠΟΔΕΚΤΕΣ": "9 ΛΔΒ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "XVI Μ/Κ ΜΠ", "ΑΠΟΔΕΚΤΕΣ": "16 ΛΔΒ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "50 Μ/Κ ΤΑΞ", "ΑΠΟΔΕΚΤΕΣ": "50 ΛΔΒ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "ΧΙΙ Μ/Κ ΜΠ", "ΑΠΟΔΕΚΤΕΣ": "12 ΛΔΒ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "ΧΧ ΤΘΜ", "ΑΠΟΔΕΚΤΕΣ": "20 ΛΔΒ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "1 ΣΠ", "ΑΠΟΔΕΚΤΕΣ": "III/9 ΛΔΒ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "3 Μ/Κ ΤΑΞ", "ΑΠΟΔΕΚΤΕΣ": "3 ΛΔΒ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "30 Μ/Κ ΤΑΞ", "ΑΠΟΔΕΚΤΕΣ": "30 ΛΔΒ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "ΤΔ 21 ΜΚ ΣΠ", "ΑΠΟΔΕΚΤΕΣ": "35 ΛΔΒ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "31 Μ/Κ ΤΑΞ", "ΑΠΟΔΕΚΤΕΣ": "31 ΛΔΒ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "ΧΧΙΙΙ ΤΘΤ", "ΑΠΟΔΕΚΤΕΣ": "23 ΛΔΒ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "ΧΧΙV ΤΘΤ", "ΑΠΟΔΕΚΤΕΣ": "24 ΛΔΒ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "ΧΧΙ ΤΘΤ", "ΑΠΟΔΕΚΤΕΣ": "21 ΛΔΒ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "XXV ΤΘΤ", "ΑΠΟΔΕΚΤΕΣ": "25 ΛΔΒ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "ΜΕΡΥΠ", "ΑΠΟΔΕΚΤΕΣ": "486 ΤΔΒ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "ΔΙΚΕ", "ΑΠΟΔΕΚΤΕΣ": "1/2/466 ΤΔΒ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "36 ΛΔΒ", "ΑΠΟΔΕΚΤΕΣ": "36 ΛΔΒ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "IV ΤΑΞΥΠ", "ΑΠΟΔΕΚΤΕΣ": "1/2/486 ΤΔΒ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "29 Μ/Π ΤΑΞ", "ΑΠΟΔΕΚΤΕΣ": "29 ΛΔΒ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "ΕΛΔΥΚ", "ΑΠΟΔΕΚΤΕΣ": "ΕΛΔΥΚ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "ΙΙ Μ/Κ ΜΠ", "ΑΠΟΔΕΚΤΕΣ": "2 ΛΔΒ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "33 Μ/Κ ΤΑΞ", "ΑΠΟΔΕΚΤΕΣ": "33 ΛΔΒ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "34 Μ/Κ ΤΑΞ", "ΑΠΟΔΕΚΤΕΣ": "34 ΛΔΒ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "2 ΣΥΑΣ", "ΑΠΟΔΕΚΤΕΣ": "ΙΙ/17 ΛΔΒ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "3 ΤΕΑΣ", "ΑΠΟΔΕΚΤΕΣ": "ΙΙΙ/17 ΛΔΒ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "472 ΤΕΠΠ", "ΑΠΟΔΕΚΤΕΣ": "472 ΤΕΠΠ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "471 ΤΗΠ", "ΑΠΟΔΕΚΤΕΣ": "471 ΤΗΠ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "476 ΤΗΠ", "ΑΠΟΔΕΚΤΕΣ": "476 ΤΗΠ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "7 Μ/Κ ΤΑΞ", "ΑΠΟΔΕΚΤΕΣ": "7 ΛΔΒ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "ΣΣΜ", "ΑΠΟΔΕΚΤΕΣ": "2/2/486 ΤΔΒ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ", "ΣΗΜΕΙΩΣΕΙΣ": "ΚΑΜΙΑ ΕΙΣΑΓΩΓΗ"},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "ΕΜΠΟΡΙΟ", "ΑΠΟΔΕΚΤΕΣ": "ΕΜΠΟΡΙΟ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "", "ΣΗΜΕΙΩΣΕΙΣ": ""},
            {"ΣΧΗΜΑΤΙΣΜΟΙ": "ΟΤΕ", "ΑΠΟΔΕΚΤΕΣ": "ΟΤΕ", "ΑΤΟΜΟ ΕΠΙΚΟΙΝΩΝΙΑΣ": "", "ΣΗΜΕΙΩΣΕΙΣ": ""},
        ]

        # Function to extract the first numerical part from the "ΣΧΗΜΑΤΙΣΜΟΙ" value
        def extract_number(text):
            match = re.search(r'\d+', text)
            return int(match.group()) if match else float('inf')

        # Sort data by the numerical part of the "ΣΧΗΜΑΤΙΣΜΟΙ" key
        data = sorted(data, key=lambda x: extract_number(x["ΣΧΗΜΑΤΙΣΜΟΙ"]))

        for item in data:
            Recipient.objects.create(
                commanding_unit=item["ΣΧΗΜΑΤΙΣΜΟΙ"],
                recipient_unit=item["ΑΠΟΔΕΚΤΕΣ"],
                notes=''
            )

        self.stdout.write(self.style.SUCCESS('Successfully imported recipient data.'))
